# BuiltInFailures.DetailFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DetailFailures Class
BuiltInFailures Class Members See Also
---
Failures about Detail.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class DetailFailures
```

Visual Basic
---
```text
Public NotInheritable Class DetailFailures
```

Visual C++
---
```text
public ref class DetailFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..DetailFailures
# See Also
BuiltInFailures..::..DetailFailures Members
Autodesk.Revit.DB Namespace